[
  {
    "類別": "大同大學資訊工程學系學士班修業規定",
    "內容": "一、 本校資訊工程學系(以下簡稱本系)為規範學士班學生修業事項,依據「大同大學學則」訂定「大同大學資訊工程學士班修業規定」(以下簡稱本規定)。二、 修業年限為四年,得延長兩年,休學期間不列入修業年限計算。三、 畢業前須滿足以下規定: (一) 修得128 學分以上。(二) 所修學分中須含系訂必修科目之規定學分、系訂專業選修科目至少26 學分以上及校訂共同必修科目之規定學分。(三) 完成專題並通過專題口試及繳交專題報告。(四) 參加 CPE 檢定考試並符合以下任一標準: 1. 單次答對2 題以上。2. 多次累計答對3 題以上。3. 參加過4次以上的檢定考試,並修過本系一門3學分之程式設計精實演練相關課程且成績及格。四、 本規定如有未盡事宜,悉依「大同大學學則」及「大同大學校訂共同必修科目及學分」規定辦理。五、本規定經系務會議及院務會議通過,報請教務會議核備後實施,修訂時亦同。"
    ,"資料來源":"https://cse.ttu.edu.tw/var/file/58/1058/img/94/203207450.pdf"
  },
  {
    "類別":"大同大學學士班英文畢業規定及輔導辦法",
    "內容":"第一條 本校為提升各院系學士班學生英文能力，特訂定英文畢業規定及輔導辦法（以下簡稱本辦法）。第二條 本校學士班學生，在校期間須通過本校認可之英文能力檢定，始得畢業。第三條 本校學士班學生於畢業前須通過多益450分、全民英檢中級初試或其他等同程度之英檢（對照標準另訂，並得依實際情況調整之）。凡通過上述校外英文能力檢定者，須持成績單正本（驗後發還）及影本一份至外語教育中心辦理登錄手續，經審核認可後，即符合英文畢業規定。第四條 未參加或未通過英文能力檢定學生，得以下列任一方式達成本校英文畢業規定：一、報名參加且完成外語教育中心自學方案課程，並報考且通過本校外語教育中心辦理之「英語能力檢定會考」。二、依規定選修（高年級優先）並通過本校開設之英語補強課程（課程為零學分，學期成績以60分為及格）。三、選修並通過本校開設之EMI課程且取得E1等級證書（EMI課程16學分），持該證書至外語教育中心辦理登錄手續，即符合英文畢業規定。第五條 母語為英語之學生得檢具SAT或ACT成績（達前60%）辦理視同通過英文畢業規定之登錄。第六條 本校主修外國語文學生英文畢業規定另訂之，各學系亦得視需要訂定更嚴格之規定，並須明列於該系之畢業規定，且送教務處備查。第七條 本辦法經教務會議通過，報請校長核定後實施，修正時亦同。"
    ,"資料來源":"https://rules.ttu.edu.tw/rulelist/ruledl.php?rid=328&Seq=3663"
  },
  {
    "類別": "大同大學資訊工程學系專題實施辦法",
    "內容": "第一條 專題課程分為兩學期實施。專題一修讀及格者才可修讀專題二。第二條 專題指導老師須為本系專任老師。若未申請更換指導老師,與原雜誌研讀指導老師為同一人。第三條 專題一時,指導老師須輔導學生完成兩次進度書面報告。兩次書面報告成績各佔專題一學期成績50%。一、第一次報告須在期中考前完成,內容至少包含專題題目、專題大綱、專題動機、進度安排及工作分配等項。二、第二次報告須在期末考前完成,內容至少包含專題目標、方法、系統架構、所需設備、相關研究、目前工作進度等項。第四條 專題二時,指導老師須輔導學生參加系展與期末的口試。未參加系展者,專題二之學期成績為期末口試成績之85%。一、學生參加系展須經指導老師推薦,未經推薦者不得參加系展。二、系展成績由系主任組成評審團評定之。三、期末口試成績應由本系專兼任教授(含指導教授)擔任口試委員評定之。第五條 該學期專題成績不及格者,下學期必須續修前一學期專題。第六條 專題二成績不及格之同學重修專題二時,除非原指導教授同意繼續指導者,否則須由特定教授給予集中輔導,進行專題實驗。集中輔導之時間、實驗內容與主持老師,由系主任召集系上老師研擬及選定。第七條 專題口試完成之後,必須繳交一份完整的專題報告以及一份簡式報告。第八條 為鼓勵修畢專題一、二且成績優良之同學,繼續將專題製作得更加完善,並參加校內外競賽,經原指導老師推薦,可選修四下開設之「進階專題實驗」。其成績之評定與進行之方式由原指導老師自行規定。第九條 本辦法經系務會議通過後實施,修改時亦同。"
    ,"資料來源":"https://view.officeapps.live.com/op/view.aspx?src=https%3A%2F%2Fcse.ttu.edu.tw%2Fvar%2Ffile%2F58%2F1058%2Fimg%2F104%2F516371747.doc&wdOrigin=BROWSELINK"
  },
  {
    "類別": "大同大學學生修讀輔系標準表",
    "說明": "一、依據大同大學學士班學生修讀輔系辦法。二、申請時間:每學期開學後加退選前向註冊組提出申請",
    "系所名稱": "資訊工程學系",
    "招收名額": "不限",
    "申請資格": "1. 符合本校學生修讀輔系辦法規定。2. 前一學年成績名次在該班人數前百分之五十以內",
    "錄取方式及占分比例": "錄取方式:以審查資料為錄取依據。占分比例: 100%。",
    "必修科目": "本系二年級以上專業必修科目至少 3 門。",
    "選修科目": "本系二年級以上專業選修科目至少 3 門。",
    "修習學分": "至少二十一學分本系專業必選修科目。"
    ,"資料來源":"https://cse.ttu.edu.tw/var/file/58/1058/img/104/890303185.pdf"
  },
  {
    "類別": "大同大學學生轉系辦法",
    "內容": "第一條 本校為辦理學生轉系事宜,依據「大同大學學則」特訂定「大同大學學生轉系辦法」(以下簡稱本辦法)。第二條 本校各學系在學學生,修業滿一學年以上者,得轉系或同系轉組。若學系另有規定,從其規定。學生在休學期間內無論具備任何理由,均不准轉系。第三條 申請轉系學生,應於本校公告期限內備妥申請書、歷年成績單及其他相關資料向註冊組提出申請,經原學系及申請轉入學系系主任同意後,轉呈教務長核定,逾期不予受理。第四條 各學系審查申請轉系者得依其成績擇優核准,或自行訂定轉系生甄選規定,甄試方式含筆試科目者,考試科目及日期均由轉入學系規定之,並由教務處註冊組彙整公告之。第五條 學生申請轉系以一次為原則,其經核准轉系者,不得請求另轉他系。若學生轉系後志趣不符,得於次年申請轉回原系,但仍須依轉系申請程序辦理。第六條 轉系學生須修滿轉入學系所規定之科目與學分,始得畢業。抵免或補修之科目與學分,由轉入學系系主任核定之。第七條 降級轉系學生,其應修科目及學分數應依其轉入年級學生入學年度之畢業學分規定。降級轉系者,其在二系重複修習之年限,不列入轉入學系之最高修業年限。第八條 本辦法如有未盡事宜,依教育部有關法令辦理。第九條 本辦法經行政會議通過後實施,修正時亦同。"
    ,"資料來源":"https://reg.ttu.edu.tw/var/file/32/1032/attach/90/pta_34655_1608598_13944.pdf"
  },
  {
    "類別": "大同大學資訊工程學系課外實習實施辦法",
    "內容": "民國93年5月11日訂定。1. 為讓資訊工程學系學生能於課業之餘有機會實際體驗職場或社會服務經驗,達到理論與實務並重的教學目標,特訂定本辦法。2. 資訊工程學系之學生得於在學期間或暑假期間到本系認可之單位進行課外實習,實習方式可為社區服務、專題研究或工廠實習。一、社區服務 A.校內:由學生自行列出服務項目(公共區域打掃、量體溫或校園外圍打掃等),由學校開列服務時數證明。B.校外:到政府立案之各公私立機構從事非學員身分之工作或志工,由工作單位開立時數證明。二、專題研究:國科會計畫(大專生暑期研究或一般有列名之計畫)及建教合作案,計畫案時數以316小時計算,外加4小時系上服務工作,協助打掃專題計畫進行之實驗室,由本系出具服務證明。三、工廠實習:依現行工廠實習辦法辦理。3. 實習時間以週或小時為單位,如以週為單位,原則上以一次八週或分兩次每次四週來進行,以小時為單位合計需實習320小時(可混合不同工作類型計算,與週為單位合併計算時,每天以八小時計算,每週以五天計算),實習期間本系將安排教師前往訪視,如發現實習性質不符本辦法所訂定之標準,本系將不予承認。"
    ,"資料來源":"https://cse.ttu.edu.tw/p/405-1058-2976,c176.php"
  },
  {
    "類別": "大同大學資訊工程學系學生校外實習實施細則",
    "內容": "一、大同大學資訊工程學系(以下簡稱本系)為讓學生瞭解職場學習情境、兼顧理論與實務之學習,提升畢業後的就業競爭力,推動校外實習課程,依「大同大學學生校外實習課程實施辦法」及「大同大學工程學院學生校外實習實施細則」相關規定,特訂定「大同大學資訊工程學系學生校外實習實施細則」(以下簡稱本細則)。二、寒暑假或學期中進行短期/累積型校外實習課程(G008*),若實習時數不足80小時不核給學分,其餘實習時數與學分數換算方式依本校校外實習課程實施辦法第六條之規定辦理,上述學分得列入本系專業選修學分,學生實習時數由導師審核之。三、學期中進行學期型全職全時(G009*)方式於校外相關專業單位工作之實習時數以每週工作40小時、實習期間達18週為原則,由該實習單位出具實習期滿證明,可獲得專業選修學分9學分,當學期選課不受最低修習學分數限制。學生須於開學日之2週前向系上申請,經核准後始得選課,若當學期該科成績評定為不通過,當學期不得改選G008*校外實習課程,但所做之實習時數得於次學期起改選G008*校外實習課程。四、實習期間由該生導師為實習輔導教師。實習成績考評,由實習輔導教師與校外實習機構單位主管共同評定。五、校外實習申請(表單請參閱大同大學校外實習相關表格)(一)實習單位認定範圍(符合下列之一即可): 1.上市上櫃興櫃公司之專業實習。2.經本系校外實習委員會通過認可有規模公司之專業實習。(二)實習前準備:欲從事校外實習者,須於開學日之2週前填具下列表單送交導師提送校外實習委員會審核: 1.實習申請表 2.家長同意書 3.三方簽訂之合約書。(三)實習期間: 1.填寫「大同大學校外實習週記」2.實習機構單位主管:針對學生的實習狀況,於學生所填「大同大學校外實習週記」填寫考核評語。3.實習輔導教師:填寫「大同大學校外實習輔導訪視紀錄表」。(四)實習結束後應提交: 1.「大同大學校外實習成效調查表」共3份:分別由實習機構單位主管、實習學生及實習學生家長填寫。2.「大同大學學生校外實習考核表」,內含實習單位簽認之「實習期滿證明」。未經本系校外實習委員會審核同意及考核之實習,均不得作為取得校外實習學分之依據。3.「大同大學校外實習週記」及「大同大學學生校外實習成果報告」,並鼓勵參加校外實習成果發表。4.由導師進行實習學分數認定並登錄成績,學生實習相關資料由系辦公室留存備查。(五)實習表單參照「大同大學校外實習相關表格」。六、海外實習原則上比照本細則辦理。七、本細則經系務會議通過後,送交院務會議及教務處核備後實施,修正時亦同。"
    ,"資料來源":"https://cse.ttu.edu.tw/var/file/58/1058/img/104/607992593.pdf"
  },
  {
    "類別": "114專題報告網路繳交流程",
    "內容": "114專題報告網路繳交流程詳如附件。注意～ 1.Email主旨請填寫Pdf檔名。2.Pdf檔案命名範例:I4A77_戚淒欺_I4B88_巴叭峇_114年專題報告.pdf 未按範例命名視為不符規定,將直接退件。需繳交:一整本專題報告(以pdf檔案呈現)內容須包含～ 1完整封面(下載途徑系網頁--大學部--檔案下載--專題報告封面頁背及簽名頁)2口試委員完整簽名頁 3專案管理 4專題報告內文"
    ,"資料來源":"https://cse.ttu.edu.tw/p/406-1058-17619%2Cr61.php?utm_source"
  },
  {
    "類別": "大學部專題口試作業程序",
    "口試申請階段": "口試申請期限:上學期12月31日,下學期5月31日前。除指導教授外,另找兩位口試委員。指導教授審核後簽名。系辦公室收到口試申請書後,登錄到系所行事曆。",
    "專題報告初稿階段": "口試日一週前,交給指導教授及口試委員各一份。",
    "口試階段": "口試期限:學校行事曆所訂成績繳交期限前五天完成。準備投影片稿給每一位口試委員,準備成績表及簽名頁各一份,準備茶水即可,不要準備其他餐點。報告及詢答完畢後,聽從指導教授指示,先行離開試場,並在門外稍候,待口試委員出場時,向口試委員致謝。邀請其他口試委員出席,並於口試前簡單介紹成員及專題題目,口試結束後,請學生先行離開試場,與口試委員討論專題是否合格,如合格則決定專題平均分數並請全體口試委員於成績表及簽名頁上簽名。系辦公室提供場地及設備必要的協助。",
    "成績處理階段": "如果專題成員不止一人時,口試委員可徵詢指導教授各成員之貢獻度,決定評分比例,並註明於成績表空白處,如未註明,代表全體成員成績相同,口試後,指導教授將成績表送交系辦公室。收到口試成績表後,將系展成績加入平均,依口試委員提供之成績分配比例,計算個別學生之成績,使平均成績等於成績表上之成績,並於學期成績表上登錄,於期末考前將學期成績表提供給負責該學期專題之各班導師。",
    "專題報告階段": "專題報告經指導教授修改並同意後,依專題報告格式列印報告,不要裝訂,送交系務助理檢查是否符合專題報告格式,若符合規格,請指導教授於簽名頁簽名之後再複製及裝訂,並依規定繳交一份專題報告及簡式報告到系辦公室。收取專題報告及簡式報告各一份並登錄,以利辦理畢業離校手續時審查用。"
    ,"資料來源":"https://view.officeapps.live.com/op/view.aspx?src=https%3A%2F%2Fcse.ttu.edu.tw%2Fvar%2Ffile%2F58%2F1058%2Fimg%2F104%2F358419860.docx&wdOrigin=BROWSELINK"
  }
]
